{"title":"Modal API - ModalProvider - ModalProvider Context","content":"<PropName\n  name=\"currentModal\"\n  type=\"string\"\n  isContextProp\n/>\nThe slug of the currently open modal. Modals compare their slug with this value to determine their open status. If the page was loaded with a ?modal=x URL parameter, this value will be used even if no matches are found.\n<PropName\n  name=\"oneIsOpen\"\n  type=\"boolean\"\n  isContextProp\n/>\nTrue when currentModal has value. The <ModalContainer> will undergo transition every time this changes.\n<PropName\n  name=\"open\"\n  type=\"method\"\n  isContextProp\n/>\nSets currentModal to the given slug. Will either add modal to the URL parameters or fire the given callback function based on handleParamChange.\n<PropName\n  name=\"toggle\"\n  type=\"method\"\n  isContextProp\n/>\nTakes the slug of any modal and opens or closes that modal based on its current status, using the open and close methods.\n<PropName\n  name=\"closeAll\"\n  type=\"method\"\n  isContextProp\n/>\nResets currentModal and oneIsOpen. Will either remove modal from the URL parameters or fire the given callback function based on handleParamChange. Unlocks all body scroll locks.\n<PropName\n  name=\"closeOnBlur\"\n  type=\"boolean\"\n  id=\"closeOnBlur-context\"\n  isContextProp\n/>\nEnables a click event on the <ModalContainer> that, when clicked, will close all modals.\n<PropName\n  name=\"setCloseOnBlur\"\n  type=\"method\"\n  isContextProp\n/>\nUsed internally to set the global closeOnBlur status. Fired each time a modal is opened based on its own closeOnBlur prop.\n<PropName\n  name=\"bodyScrollIsLocked\"\n  type=\"boolean\"\n  isContextProp\n/>\nThe current state of body scroll lock, useful when multiple modals differ in lockBodyScroll.\n<PropName\n  name=\"setBodyScrollLock\"\n  type=\"method\"\n  isContextProp\n/>\nEnables and disables scroll on the HTML body using body-scroll-lock. Fired by lockBodyScroll on each modal individually. Check bodyScrollIsLocked for the global status after overrides.\n<PropName\n  name=\"containerRef\"\n  type=\"object\"\n  isContextProp\n/>\nA reference to <ModalContainer>, where each modal portals into.\n<PropName\n  name=\"setContainerRef\"\n  type=\"method\"\n  isContextProp\n/>\nUsed by <ModalContainer> to populate containerRef on mount.\n<BasicContext href=\"#modalprovider-props\" />\n</JumplistNode>\n<JumplistNode nodeID=\"container\">"}