{"title":"Slider API - SliderProvider - SliderProvider Props","content":"<PropName\n  name=\"slidesToShow\"\n  type=\"number\"\n/>\nThe number of slides within the track. This effects the width of each slide.\n<PropName\n  name=\"breakpoints\"\n  type=\"object\"\n/>\nMakes your slider responsive by overriding your slider settings for any CSS media queries.\n<PropName\n  name=\"slideOnSelect\"\n  type=\"boolean\"\n/>\nWhen true, navigates the slider directly to any slide that is clicked.\n<PropName\n  name=\"scrollOffset\"\n  type=\"number\"\n/>\nAdjusts the scroll target when navigating slides. Useful when slides need to maintain alignment with other elements on the page. Defaults to 0.\n<PropName\n  name=\"onSlide\"\n  type=\"method\"\n/>\nA callback fired on every slide change. Returns the current slide index.\n<PropName\n  name=\"scrollable\"\n  type=\"boolean\"\n/>\nEnables both wheel and drag-based events to scroll the track. Defaults to true. If desired, you can disable dragScroll independently.\n<PropName\n  name=\"dragScroll\"\n  type=\"boolean\"\n/>\nEnables drag-based events to scroll the track. Automatically enabled when scrollable scrollable is true.\n<PropName\n  name=\"scrollSnap\"\n  type=\"boolean\"\n/>\nEnables native CSS Scroll Snap. Defaults to true.\n<PropName\n  name=\"autoPlay\"\n  type=\"boolean\"\n/>\nWhether to autoplay on load. Defaults to false.\n<PropName\n  name=\"autoplaySpeed\"\n  type=\"number\"\n/>\nThe speed of the autoplay. Only applicable when autoplay is true. Defaults to 2000.\n<PropName\n  name=\"marquee\"\n  type=\"boolean\"\n/>\nWhether to marquee the slider which scrolls slowly through the track as opposed to sliding one-by-one. autoPlay must not be enabled.\n<PropName\n  name=\"marqueeSpeed\"\n  type=\"number\"\n/>\nThe speed of the marquee. Only applicable when marquee is true. Defaults to 50.\n<PropName\n  name=\"pauseOnHover\"\n  type=\"boolean\"\n/>\nOnly applicable when autoPlay is true. Defaults to true.\n<PropName\n  name=\"pause\"\n  type=\"boolean\"\n/>\nStops and startsautoPlay. Set to undefined to return control back to the slider.\n<PropName\n  name=\"alignLastSlide\"\n  type=\"string or number\"\n/>\nRenders an invisible div at the end of your <SliderTrack> used to align the last slide of your slider to various points along your track. Accepts a CSS value or number, with negative values beginning from track-right. Set to trackLeft to align to the left edge of your last slide to the left edge of your slider track. Set to offsetLeft to include your scrollOffset.\n<PropName\n  name=\"id\"\n  type=\"string\"\n/>\nA unique ID used to match ARIA attributes between the slider components. Defaults to a random string from the useId hook. See accessibility for full details.\n<PropName\n  name=\"useFreeScroll DEPRECATED\"\n  type=\"boolean\"\n/>\nThis prop will be deprecated in the next major release. Use  scrollable instead."}